nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.50,  512]

backbone:
  - [-1, 1, Conv,  [64,  3, 2]]          # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]          # 1  P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2  160x160  ch=256

  - [-1, 1, Conv,  [256, 3, 2]]          # 3  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4   80x80   ch=512  <- qk (higher res)

  - [-1, 1, Conv,  [512, 3, 2]]          # 5  P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6   40x40   ch=512  <- v  (lower res, richer)

  # MPSA: v=layer6(40x40,512ch)  qk=layer4(80x80,512ch)  — different layers, different res
  - [[6, 4], 1, MPSA, [512, 512, 512]]  # 7   40x40   ch=512

  # MDA: channel attention on enriched P4
  - [-1, 1, MDA,   [512]]               # 8   40x40   ch=512

  - [-1, 1, Conv,  [1024, 3, 2]]         # 9  P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]     # 10  20x20   ch=1024

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11  40x40
  - [[-1, 8], 1, Concat, [1]]                    # 12  cat P4 after MDA
  - [-1, 2, A2C2f, [512, False, -1]]            # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14  80x80
  - [[-1, 4], 1, Concat, [1]]                    # 15  cat P3 (layer4, 80x80)
  - [-1, 2, A2C2f, [256, False, -1]]            # 16

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18  cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 19

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21  cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 22

  - [[16, 19, 22], 1, Detect, [nc]]             # Detect(P3, P4, P5) — three scales